HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  20C, Receive Status Register */
#define PSI5_CH3_RSR /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RSR*)0xF000520Cu)

/** Alias (User Manual Name) for PSI5_CH3_RSR.
* To use register names with standard convension, please use PSI5_CH3_RSR.
*/
#define	PSI5_RSR3	(PSI5_CH3_RSR)

/** \\brief  240, Send Control Register */
#define PSI5_CH3_SCR /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF0005240u)

/** Alias (User Manual Name) for PSI5_CH3_SCR.
* To use register names with standard convension, please use PSI5_CH3_SCR.
*/
#define	PSI5_SCR3	(PSI5_CH3_SCR)

/** \\brief  248, Send Data Register High */
#define PSI5_CH3_SDRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF0005248u)

/** Alias (User Manual Name) for PSI5_CH3_SDRH.
* To use register names with standard convension, please use PSI5_CH3_SDRH.
*/
#define	PSI5_SDRH3	(PSI5_CH3_SDRH)

/** \\brief  244, Send Data Register Low */
#define PSI5_CH3_SDRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF0005244u)

/** Alias (User Manual Name) for PSI5_CH3_SDRL.
* To use register names with standard convension, please use PSI5_CH3_SDRL.
*/
#define	PSI5_SDRL3	(PSI5_CH3_SDRL)

/** \\brief  210, Serial Data and Status Register */
#define PSI5_CH3_SDS0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005210u)

/** Alias (User Manual Name) for PSI5_CH3_SDS0.
* To use register names with standard convension, please use PSI5_CH3_SDS0.
*/
#define	PSI5_SDS30	(PSI5_CH3_SDS0)

/** \\brief  214, Serial Data and Status Register */
#define PSI5_CH3_SDS1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005214u)

/** Alias (User Manual Name) for PSI5_CH3_SDS1.
* To use register names with standard convension, please use PSI5_CH3_SDS1.
*/
#define	PSI5_SDS31	(PSI5_CH3_SDS1)

/** \\brief  218, Serial Data and Status Register */
#define PSI5_CH3_SDS2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005218u)

/** Alias (User Manual Name) for PSI5_CH3_SDS2.
* To use register names with standard convension, please use PSI5_CH3_SDS2.
*/
#define	PSI5_SDS32	(PSI5_CH3_SDS2)

/** \\brief  21C, Serial Data and Status Register */
#define PSI5_CH3_SDS3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF000521Cu)

/** Alias (User Manual Name) for PSI5_CH3_SDS3.
* To use register names with standard convension, please use PSI5_CH3_SDS3.
*/
#define	PSI5_SDS33	(PSI5_CH3_SDS3)

/** \\brief  220, Serial Data and Status Register */
#define PSI5_CH3_SDS4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005220u)

/** Alias (User Manual Name) for PSI5_CH3_SDS4.
* To use register names with standard convension, please use PSI5_CH3_SDS4.
*/
#define	PSI5_SDS34	(PSI5_CH3_SDS4)

/** \\brief  224, Serial Data and Status Register */
#define PSI5_CH3_SDS5 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005224u)

/** Alias (User Manual Name) for PSI5_CH3_SDS5.
* To use register names with standard convension, please use PSI5_CH3_SDS5.
*/
#define	PSI5_SDS35	(PSI5_CH3_SDS5)

/** \\brief  22C, SOF TS Capture Register SFTSC */
#define PSI5_CH3_SFTSC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SFTSC*)0xF000522Cu)

/** Alias (User Manual Name) for PSI5_CH3_SFTSC.
* To use register names with standard convension, please use PSI5_CH3_SFTSC.
*/
#define	PSI5_SFTSC3	(PSI5_CH3_SFTSC)

/** \\brief  258, Send Output Register High */
#define PSI5_CH3_SORH /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SORH*)0xF0005258u)

/** Alias (User Manual Name) for PSI5_CH3_SORH.
* To use register names with standard convension, please use PSI5_CH3_SORH.
*/
#define	PSI5_SORH3	(PSI5_CH3_SORH)

/** \\brief  254, Send Output Register Low */
#define PSI5_CH3_SORL /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SORL*)0xF0005254u)

/** Alias (User Manual Name) for PSI5_CH3_SORL.
* To use register names with standard convension, please use PSI5_CH3_SORL.
*/
#define	PSI5_SORL3	(PSI5_CH3_SORL)

/** \\brief  228, SOP TS Capture Register SPTSC */
#define PSI5_CH3_SPTSC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SPTSC*)0xF0005228u)

/** Alias (User Manual Name) for PSI5_CH3_SPTSC.
* To use register names with standard convension, please use PSI5_CH3_SPTSC.
*/
#define	PSI5_SPTSC3	(PSI5_CH3_SPTSC)

/** \\brief  250, Send Shift Register High */
#define PSI5_CH3_SSRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF0005250u)

/** Alias (User Manual Name) for PSI5_CH3_SSRH.
* To use register names with standard convension, please use PSI5_CH3_SSRH.
*/
#define	PSI5_SSRH3	(PSI5_CH3_SSRH)

/** \\brief  24C, Send Shift Register Low */
#define PSI5_CH3_SSRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF000524Cu)

/** Alias (User Manual Name) for PSI5_CH3_SSRL.
* To use register names with standard convension, please use PSI5_CH3_SSRL.
*/
#define	PSI5_SSRL3	(PSI5_CH3_SSRL)

/** \\brief  1F0, Watch Dog Timer Register */
#define PSI5_CH3_WDT0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F0u)

/** Alias (User Manual Name) for PSI5_CH3_WDT0.
* To use register names with standard convension, please use PSI5_CH3_WDT0.
*/
#define	PSI5_WDT30	(PSI5_CH3_WDT0)

/** \\brief  1F4, Watch Dog Timer Register */
#define PSI5_CH3_WDT1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F4u)

/** Alias (User Manual Name) for PSI5_CH3_WDT1.
* To use register names with standard convension, please use PSI5_CH3_WDT1.
*/
#define	PSI5_WDT31	(PSI5_CH3_WDT1)

/** \\brief  1F8, Watch Dog Timer Register */
#define PSI5_CH3_WDT2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F8u)

/** Alias (User Manual Name) for PSI5_CH3_WDT2.
* To use register names with standard convension, please use PSI5_CH3_WDT2.
*/
#define	PSI5_WDT32	(PSI5_CH3_WDT2)

/** \\brief  1FC, Watch Dog Timer Register */
#define PSI5_CH3_WDT3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051FCu)

/** Alias (User Manual Name) for PSI5_CH3_WDT3.
* To use register names with standard convension, please use PSI5_CH3_WDT3.
*/
#define	PSI5_WDT33	(PSI5_CH3_WDT3)

/** \\brief  200, Watch Dog Timer Register */
#define PSI5_CH3_WDT4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005200u)

/** Alias (User Manual Name) for PSI5_CH3_WDT4.
* To use register names with standard convension, please use PSI5_CH3_WDT4.
*/
#define	PSI5_WDT34	(PSI5_CH3_WDT4)

/** \\brief  204, Watch Dog Timer Register */
#define PSI5_CH3_WDT5 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005204u)

/** Alias (User Manual Name) for PSI5_CH3_WDT5.
* To use register names with standard convension, please use PSI5_CH3_WDT5.
*/
#define	PSI5_WDT35	(PSI5_CH3_WDT5)

/** \\brief  208, Watch Dog Timer Register */
#define PSI5_CH3_WDT6 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005208u)

/** Alias (User Manual Name) for PSI5_CH3_WDT6.
* To use register names with standard convension, please use PSI5_CH3_WDT6.
*/
#define	PSI5_WDT36	(PSI5_CH3_WDT6)

