HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** Alias (User Manual Name) for PSI5_CH4_SORL.
* To use register names with standard convension, please use PSI5_CH4_SORL.
*/
#define	PSI5_SORL4	(PSI5_CH4_SORL)

/** \\brief  2B8, SOP TS Capture Register SPTSC */
#define PSI5_CH4_SPTSC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SPTSC*)0xF00052B8u)

/** Alias (User Manual Name) for PSI5_CH4_SPTSC.
* To use register names with standard convension, please use PSI5_CH4_SPTSC.
*/
#define	PSI5_SPTSC4	(PSI5_CH4_SPTSC)

/** \\brief  2E0, Send Shift Register High */
#define PSI5_CH4_SSRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF00052E0u)

/** Alias (User Manual Name) for PSI5_CH4_SSRH.
* To use register names with standard convension, please use PSI5_CH4_SSRH.
*/
#define	PSI5_SSRH4	(PSI5_CH4_SSRH)

/** \\brief  2DC, Send Shift Register Low */
#define PSI5_CH4_SSRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF00052DCu)

/** Alias (User Manual Name) for PSI5_CH4_SSRL.
* To use register names with standard convension, please use PSI5_CH4_SSRL.
*/
#define	PSI5_SSRL4	(PSI5_CH4_SSRL)

/** \\brief  280, Watch Dog Timer Register */
#define PSI5_CH4_WDT0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005280u)

/** Alias (User Manual Name) for PSI5_CH4_WDT0.
* To use register names with standard convension, please use PSI5_CH4_WDT0.
*/
#define	PSI5_WDT40	(PSI5_CH4_WDT0)

/** \\brief  284, Watch Dog Timer Register */
#define PSI5_CH4_WDT1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005284u)

/** Alias (User Manual Name) for PSI5_CH4_WDT1.
* To use register names with standard convension, please use PSI5_CH4_WDT1.
*/
#define	PSI5_WDT41	(PSI5_CH4_WDT1)

/** \\brief  288, Watch Dog Timer Register */
#define PSI5_CH4_WDT2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005288u)

/** Alias (User Manual Name) for PSI5_CH4_WDT2.
* To use register names with standard convension, please use PSI5_CH4_WDT2.
*/
#define	PSI5_WDT42	(PSI5_CH4_WDT2)

/** \\brief  28C, Watch Dog Timer Register */
#define PSI5_CH4_WDT3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF000528Cu)

/** Alias (User Manual Name) for PSI5_CH4_WDT3.
* To use register names with standard convension, please use PSI5_CH4_WDT3.
*/
#define	PSI5_WDT43	(PSI5_CH4_WDT3)

/** \\brief  290, Watch Dog Timer Register */
#define PSI5_CH4_WDT4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005290u)

/** Alias (User Manual Name) for PSI5_CH4_WDT4.
* To use register names with standard convension, please use PSI5_CH4_WDT4.
*/
#define	PSI5_WDT44	(PSI5_CH4_WDT4)

/** \\brief  294, Watch Dog Timer Register */
#define PSI5_CH4_WDT5 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005294u)

/** Alias (User Manual Name) for PSI5_CH4_WDT5.
* To use register names with standard convension, please use PSI5_CH4_WDT5.
*/
#define	PSI5_WDT45	(PSI5_CH4_WDT5)

/** \\brief  298, Watch Dog Timer Register */
#define PSI5_CH4_WDT6 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005298u)

/** Alias (User Manual Name) for PSI5_CH4_WDT6.
* To use register names with standard convension, please use PSI5_CH4_WDT6.
*/
#define	PSI5_WDT46	(PSI5_CH4_WDT6)

/** \\brief  0, Clock Control Register */
#define PSI5_CLC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CLC*)0xF0005000u)

/** \\brief  59C, CRCIOV Clear Register */
#define PSI5_CRCICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF000559Cu)

/** \\brief  5A0, CRCIOV Clear Register */
#define PSI5_CRCICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A0u)

/** \\brief  5A4, CRCIOV Clear Register */
#define PSI5_CRCICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A4u)

/** \\brief  5A8, CRCIOV Clear Register */
#define PSI5_CRCICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A8u)

/** \\brief  5AC, CRCIOV Clear Register */
#define PSI5_CRCICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055ACu)

/** \\brief  45C, CRCI Overview Register */
#define PSI5_CRCIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF000545Cu)

/** \\brief  460, CRCI Overview Register */
#define PSI5_CRCIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005460u)

/** \\brief  464, CRCI Overview Register */
#define PSI5_CRCIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005464u)

/** \\brief  468, CRCI Overview Register */
#define PSI5_CRCIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005468u)

/** \\brief  46C, CRCI Overview Register */
#define PSI5_CRCIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF000546Cu)

/** \\brief  4FC, CRCIOV Set Register */
#define PSI5_CRCISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF00054FCu)

/** \\brief  500, CRCIOV Set Register */
#define PSI5_CRCISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005500u)

/** \\brief  504, CRCIOV Set Register */
#define PSI5_CRCISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005504u)

/** \\brief  508, CRCIOV Set Register */
#define PSI5_CRCISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005508u)

/** \\brief  50C, CRCIOV Set Register */
#define PSI5_CRCISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF000550Cu)

/** \\brief  C, PSI5 Fractional Divider Register */
#define PSI5_FDR /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDR*)0xF000500Cu)

/** \\brief  14, Fractional Divider Register for Higher Bit Rate */
#define PSI5_FDRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDRH*)0xF0005014u)

/** \\brief  10, Fractional Divider Register for Lower Bit Rate */
#define PSI5_FDRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDRL*)0xF0005010u)

/** \\brief  18, Fractional Divider Register for Time Stamp */
#define PSI5_FDRT /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDRT*)0xF0005018u)

/** \\brief  2C, Global Control Register */
#define PSI5_GCR /*lint --e(923)*/ (*(volatile Ifx_PSI5_GCR*)0xF000502Cu)

/** \\brief  8, Module Identification Register */
#define PSI5_ID /*lint --e(923)*/ (*(volatile Ifx_PSI5_ID*)0xF0005008u)

/** \\brief  2FC, Interrupt Node Pointer Register */
#define PSI5_INP0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF00052FCu)

