HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  300, Interrupt Node Pointer Register */
#define PSI5_INP1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF0005300u)

/** \\brief  304, Interrupt Node Pointer Register */
#define PSI5_INP2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF0005304u)

/** \\brief  308, Interrupt Node Pointer Register */
#define PSI5_INP3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF0005308u)

/** \\brief  30C, Interrupt Node Pointer Register */
#define PSI5_INP4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF000530Cu)

/** \\brief  360, Interrupt Clear Register A */
#define PSI5_INTCLRA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005360u)

/** \\brief  364, Interrupt Clear Register A */
#define PSI5_INTCLRA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005364u)

/** \\brief  368, Interrupt Clear Register A */
#define PSI5_INTCLRA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005368u)

/** \\brief  36C, Interrupt Clear Register A */
#define PSI5_INTCLRA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF000536Cu)

/** \\brief  370, Interrupt Clear Register A */
#define PSI5_INTCLRA4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005370u)

/** \\brief  374, Interrupt Clear Register A */
#define PSI5_INTCLRB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005374u)

/** \\brief  378, Interrupt Clear Register A */
#define PSI5_INTCLRB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005378u)

/** \\brief  37C, Interrupt Clear Register A */
#define PSI5_INTCLRB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF000537Cu)

/** \\brief  380, Interrupt Clear Register A */
#define PSI5_INTCLRB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005380u)

/** \\brief  384, Interrupt Clear Register A */
#define PSI5_INTCLRB4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005384u)

/** \\brief  388, Interrupt Enable Register A */
#define PSI5_INTENA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005388u)

/** \\brief  38C, Interrupt Enable Register A */
#define PSI5_INTENA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF000538Cu)

/** \\brief  390, Interrupt Enable Register A */
#define PSI5_INTENA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005390u)

/** \\brief  394, Interrupt Enable Register A */
#define PSI5_INTENA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005394u)

/** \\brief  398, Interrupt Enable Register A */
#define PSI5_INTENA4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005398u)

/** \\brief  39C, Interrupt Enable Register B */
#define PSI5_INTENB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF000539Cu)

/** \\brief  3A0, Interrupt Enable Register B */
#define PSI5_INTENB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A0u)

/** \\brief  3A4, Interrupt Enable Register B */
#define PSI5_INTENB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A4u)

/** \\brief  3A8, Interrupt Enable Register B */
#define PSI5_INTENB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A8u)

/** \\brief  3AC, Interrupt Enable Register B */
#define PSI5_INTENB4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053ACu)

/** \\brief  2F8, Interrupt Overview Register */
#define PSI5_INTOV /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTOV*)0xF00052F8u)

/** \\brief  338, Interrupt Set Register A */
#define PSI5_INTSETA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005338u)

/** \\brief  33C, Interrupt Set Register A */
#define PSI5_INTSETA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF000533Cu)

/** \\brief  340, Interrupt Set Register A */
#define PSI5_INTSETA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005340u)

/** \\brief  344, Interrupt Set Register A */
#define PSI5_INTSETA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005344u)

/** \\brief  348, Interrupt Set Register A */
#define PSI5_INTSETA4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005348u)

/** \\brief  34C, Interrupt Set Register B */
#define PSI5_INTSETB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF000534Cu)

/** \\brief  350, Interrupt Set Register B */
#define PSI5_INTSETB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005350u)

/** \\brief  354, Interrupt Set Register B */
#define PSI5_INTSETB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005354u)

/** \\brief  358, Interrupt Set Register B */
#define PSI5_INTSETB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005358u)

/** \\brief  35C, Interrupt Set Register B */
#define PSI5_INTSETB4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF000535Cu)

/** \\brief  310, Interrupt Status Register A */
#define PSI5_INTSTATA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005310u)

/** \\brief  314, Interrupt Status Register A */
#define PSI5_INTSTATA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005314u)

/** \\brief  318, Interrupt Status Register A */
#define PSI5_INTSTATA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005318u)

/** \\brief  31C, Interrupt Status Register A */
#define PSI5_INTSTATA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF000531Cu)

/** \\brief  320, Interrupt Status Register A */
#define PSI5_INTSTATA4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005320u)

/** \\brief  324, Interrupt Status Register B */
#define PSI5_INTSTATB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005324u)

/** \\brief  328, Interrupt Status Register B */
#define PSI5_INTSTATB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005328u)

/** \\brief  32C, Interrupt Status Register B */
#define PSI5_INTSTATB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF000532Cu)

/** \\brief  330, Interrupt Status Register B */
#define PSI5_INTSTATB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005330u)

/** \\brief  334, Interrupt Status Register B */
#define PSI5_INTSTATB4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005334u)

/** \\brief  3D8, Kernel Reset Register 0 */
#define PSI5_KRST0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRST0*)0xF00053D8u)

