HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  848, Receive Data Memory Low */
#define PSI5_RDM2_9_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005848u)

/** Alias (User Manual Name) for PSI5_RDM2_9_L.
* To use register names with standard convension, please use PSI5_RDM2_9_L.
*/
#define	PSI5_RDML29	(PSI5_RDM2_9_L)

/** \\brief  904, Receive Data Memory High */
#define PSI5_RDM3_0_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005904u)

/** Alias (User Manual Name) for PSI5_RDM3_0_H.
* To use register names with standard convension, please use PSI5_RDM3_0_H.
*/
#define	PSI5_RDMH30	(PSI5_RDM3_0_H)

/** \\brief  900, Receive Data Memory Low */
#define PSI5_RDM3_0_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005900u)

/** Alias (User Manual Name) for PSI5_RDM3_0_L.
* To use register names with standard convension, please use PSI5_RDM3_0_L.
*/
#define	PSI5_RDML30	(PSI5_RDM3_0_L)

/** \\brief  954, Receive Data Memory High */
#define PSI5_RDM3_10_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005954u)

/** Alias (User Manual Name) for PSI5_RDM3_10_H.
* To use register names with standard convension, please use PSI5_RDM3_10_H.
*/
#define	PSI5_RDMH310	(PSI5_RDM3_10_H)

/** \\brief  950, Receive Data Memory Low */
#define PSI5_RDM3_10_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005950u)

/** Alias (User Manual Name) for PSI5_RDM3_10_L.
* To use register names with standard convension, please use PSI5_RDM3_10_L.
*/
#define	PSI5_RDML310	(PSI5_RDM3_10_L)

/** \\brief  95C, Receive Data Memory High */
#define PSI5_RDM3_11_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000595Cu)

/** Alias (User Manual Name) for PSI5_RDM3_11_H.
* To use register names with standard convension, please use PSI5_RDM3_11_H.
*/
#define	PSI5_RDMH311	(PSI5_RDM3_11_H)

/** \\brief  958, Receive Data Memory Low */
#define PSI5_RDM3_11_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005958u)

/** Alias (User Manual Name) for PSI5_RDM3_11_L.
* To use register names with standard convension, please use PSI5_RDM3_11_L.
*/
#define	PSI5_RDML311	(PSI5_RDM3_11_L)

/** \\brief  964, Receive Data Memory High */
#define PSI5_RDM3_12_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005964u)

/** Alias (User Manual Name) for PSI5_RDM3_12_H.
* To use register names with standard convension, please use PSI5_RDM3_12_H.
*/
#define	PSI5_RDMH312	(PSI5_RDM3_12_H)

/** \\brief  960, Receive Data Memory Low */
#define PSI5_RDM3_12_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005960u)

/** Alias (User Manual Name) for PSI5_RDM3_12_L.
* To use register names with standard convension, please use PSI5_RDM3_12_L.
*/
#define	PSI5_RDML312	(PSI5_RDM3_12_L)

/** \\brief  96C, Receive Data Memory High */
#define PSI5_RDM3_13_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000596Cu)

/** Alias (User Manual Name) for PSI5_RDM3_13_H.
* To use register names with standard convension, please use PSI5_RDM3_13_H.
*/
#define	PSI5_RDMH313	(PSI5_RDM3_13_H)

/** \\brief  968, Receive Data Memory Low */
#define PSI5_RDM3_13_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005968u)

/** Alias (User Manual Name) for PSI5_RDM3_13_L.
* To use register names with standard convension, please use PSI5_RDM3_13_L.
*/
#define	PSI5_RDML313	(PSI5_RDM3_13_L)

/** \\brief  974, Receive Data Memory High */
#define PSI5_RDM3_14_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005974u)

/** Alias (User Manual Name) for PSI5_RDM3_14_H.
* To use register names with standard convension, please use PSI5_RDM3_14_H.
*/
#define	PSI5_RDMH314	(PSI5_RDM3_14_H)

/** \\brief  970, Receive Data Memory Low */
#define PSI5_RDM3_14_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005970u)

/** Alias (User Manual Name) for PSI5_RDM3_14_L.
* To use register names with standard convension, please use PSI5_RDM3_14_L.
*/
#define	PSI5_RDML314	(PSI5_RDM3_14_L)

/** \\brief  97C, Receive Data Memory High */
#define PSI5_RDM3_15_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000597Cu)

/** Alias (User Manual Name) for PSI5_RDM3_15_H.
* To use register names with standard convension, please use PSI5_RDM3_15_H.
*/
#define	PSI5_RDMH315	(PSI5_RDM3_15_H)

/** \\brief  978, Receive Data Memory Low */
#define PSI5_RDM3_15_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005978u)

/** Alias (User Manual Name) for PSI5_RDM3_15_L.
* To use register names with standard convension, please use PSI5_RDM3_15_L.
*/
#define	PSI5_RDML315	(PSI5_RDM3_15_L)

/** \\brief  984, Receive Data Memory High */
#define PSI5_RDM3_16_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005984u)

/** Alias (User Manual Name) for PSI5_RDM3_16_H.
* To use register names with standard convension, please use PSI5_RDM3_16_H.
*/
#define	PSI5_RDMH316	(PSI5_RDM3_16_H)

/** \\brief  980, Receive Data Memory Low */
#define PSI5_RDM3_16_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005980u)

/** Alias (User Manual Name) for PSI5_RDM3_16_L.
* To use register names with standard convension, please use PSI5_RDM3_16_L.
*/
#define	PSI5_RDML316	(PSI5_RDM3_16_L)

/** \\brief  98C, Receive Data Memory High */
#define PSI5_RDM3_17_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000598Cu)

/** Alias (User Manual Name) for PSI5_RDM3_17_H.
* To use register names with standard convension, please use PSI5_RDM3_17_H.
*/
#define	PSI5_RDMH317	(PSI5_RDM3_17_H)

/** \\brief  988, Receive Data Memory Low */
#define PSI5_RDM3_17_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005988u)

/** Alias (User Manual Name) for PSI5_RDM3_17_L.
* To use register names with standard convension, please use PSI5_RDM3_17_L.
*/
#define	PSI5_RDML317	(PSI5_RDM3_17_L)

/** \\brief  994, Receive Data Memory High */
#define PSI5_RDM3_18_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005994u)

/** Alias (User Manual Name) for PSI5_RDM3_18_H.
* To use register names with standard convension, please use PSI5_RDM3_18_H.
*/
#define	PSI5_RDMH318	(PSI5_RDM3_18_H)

/** \\brief  990, Receive Data Memory Low */
#define PSI5_RDM3_18_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005990u)

/** Alias (User Manual Name) for PSI5_RDM3_18_L.
* To use register names with standard convension, please use PSI5_RDM3_18_L.
*/
#define	PSI5_RDML318	(PSI5_RDM3_18_L)

/** \\brief  99C, Receive Data Memory High */
#define PSI5_RDM3_19_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000599Cu)

