HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  9E0, Receive Data Memory Low */
#define PSI5_RDM3_28_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059E0u)

/** Alias (User Manual Name) for PSI5_RDM3_28_L.
* To use register names with standard convension, please use PSI5_RDM3_28_L.
*/
#define	PSI5_RDML328	(PSI5_RDM3_28_L)

/** \\brief  9EC, Receive Data Memory High */
#define PSI5_RDM3_29_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059ECu)

/** Alias (User Manual Name) for PSI5_RDM3_29_H.
* To use register names with standard convension, please use PSI5_RDM3_29_H.
*/
#define	PSI5_RDMH329	(PSI5_RDM3_29_H)

/** \\brief  9E8, Receive Data Memory Low */
#define PSI5_RDM3_29_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059E8u)

/** Alias (User Manual Name) for PSI5_RDM3_29_L.
* To use register names with standard convension, please use PSI5_RDM3_29_L.
*/
#define	PSI5_RDML329	(PSI5_RDM3_29_L)

/** \\brief  914, Receive Data Memory High */
#define PSI5_RDM3_2_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005914u)

/** Alias (User Manual Name) for PSI5_RDM3_2_H.
* To use register names with standard convension, please use PSI5_RDM3_2_H.
*/
#define	PSI5_RDMH32	(PSI5_RDM3_2_H)

/** \\brief  910, Receive Data Memory Low */
#define PSI5_RDM3_2_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005910u)

/** Alias (User Manual Name) for PSI5_RDM3_2_L.
* To use register names with standard convension, please use PSI5_RDM3_2_L.
*/
#define	PSI5_RDML32	(PSI5_RDM3_2_L)

/** \\brief  9F4, Receive Data Memory High */
#define PSI5_RDM3_30_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059F4u)

/** Alias (User Manual Name) for PSI5_RDM3_30_H.
* To use register names with standard convension, please use PSI5_RDM3_30_H.
*/
#define	PSI5_RDMH330	(PSI5_RDM3_30_H)

/** \\brief  9F0, Receive Data Memory Low */
#define PSI5_RDM3_30_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059F0u)

/** Alias (User Manual Name) for PSI5_RDM3_30_L.
* To use register names with standard convension, please use PSI5_RDM3_30_L.
*/
#define	PSI5_RDML330	(PSI5_RDM3_30_L)

/** \\brief  9FC, Receive Data Memory High */
#define PSI5_RDM3_31_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059FCu)

/** Alias (User Manual Name) for PSI5_RDM3_31_H.
* To use register names with standard convension, please use PSI5_RDM3_31_H.
*/
#define	PSI5_RDMH331	(PSI5_RDM3_31_H)

/** \\brief  9F8, Receive Data Memory Low */
#define PSI5_RDM3_31_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059F8u)

/** Alias (User Manual Name) for PSI5_RDM3_31_L.
* To use register names with standard convension, please use PSI5_RDM3_31_L.
*/
#define	PSI5_RDML331	(PSI5_RDM3_31_L)

/** \\brief  91C, Receive Data Memory High */
#define PSI5_RDM3_3_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000591Cu)

/** Alias (User Manual Name) for PSI5_RDM3_3_H.
* To use register names with standard convension, please use PSI5_RDM3_3_H.
*/
#define	PSI5_RDMH33	(PSI5_RDM3_3_H)

/** \\brief  918, Receive Data Memory Low */
#define PSI5_RDM3_3_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005918u)

/** Alias (User Manual Name) for PSI5_RDM3_3_L.
* To use register names with standard convension, please use PSI5_RDM3_3_L.
*/
#define	PSI5_RDML33	(PSI5_RDM3_3_L)

/** \\brief  924, Receive Data Memory High */
#define PSI5_RDM3_4_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005924u)

/** Alias (User Manual Name) for PSI5_RDM3_4_H.
* To use register names with standard convension, please use PSI5_RDM3_4_H.
*/
#define	PSI5_RDMH34	(PSI5_RDM3_4_H)

/** \\brief  920, Receive Data Memory Low */
#define PSI5_RDM3_4_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005920u)

/** Alias (User Manual Name) for PSI5_RDM3_4_L.
* To use register names with standard convension, please use PSI5_RDM3_4_L.
*/
#define	PSI5_RDML34	(PSI5_RDM3_4_L)

/** \\brief  92C, Receive Data Memory High */
#define PSI5_RDM3_5_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000592Cu)

/** Alias (User Manual Name) for PSI5_RDM3_5_H.
* To use register names with standard convension, please use PSI5_RDM3_5_H.
*/
#define	PSI5_RDMH35	(PSI5_RDM3_5_H)

/** \\brief  928, Receive Data Memory Low */
#define PSI5_RDM3_5_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005928u)

/** Alias (User Manual Name) for PSI5_RDM3_5_L.
* To use register names with standard convension, please use PSI5_RDM3_5_L.
*/
#define	PSI5_RDML35	(PSI5_RDM3_5_L)

/** \\brief  934, Receive Data Memory High */
#define PSI5_RDM3_6_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005934u)

/** Alias (User Manual Name) for PSI5_RDM3_6_H.
* To use register names with standard convension, please use PSI5_RDM3_6_H.
*/
#define	PSI5_RDMH36	(PSI5_RDM3_6_H)

/** \\brief  930, Receive Data Memory Low */
#define PSI5_RDM3_6_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005930u)

/** Alias (User Manual Name) for PSI5_RDM3_6_L.
* To use register names with standard convension, please use PSI5_RDM3_6_L.
*/
#define	PSI5_RDML36	(PSI5_RDM3_6_L)

/** \\brief  93C, Receive Data Memory High */
#define PSI5_RDM3_7_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000593Cu)

/** Alias (User Manual Name) for PSI5_RDM3_7_H.
* To use register names with standard convension, please use PSI5_RDM3_7_H.
*/
#define	PSI5_RDMH37	(PSI5_RDM3_7_H)

/** \\brief  938, Receive Data Memory Low */
#define PSI5_RDM3_7_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005938u)

/** Alias (User Manual Name) for PSI5_RDM3_7_L.
* To use register names with standard convension, please use PSI5_RDM3_7_L.
*/
#define	PSI5_RDML37	(PSI5_RDM3_7_L)

/** \\brief  944, Receive Data Memory High */
#define PSI5_RDM3_8_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005944u)

/** Alias (User Manual Name) for PSI5_RDM3_8_H.
* To use register names with standard convension, please use PSI5_RDM3_8_H.
*/
#define	PSI5_RDMH38	(PSI5_RDM3_8_H)

/** \\brief  940, Receive Data Memory Low */
#define PSI5_RDM3_8_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005940u)

/** Alias (User Manual Name) for PSI5_RDM3_8_L.
* To use register names with standard convension, please use PSI5_RDM3_8_L.
*/
#define	PSI5_RDML38	(PSI5_RDM3_8_L)

/** \\brief  94C, Receive Data Memory High */
#define PSI5_RDM3_9_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000594Cu)

/** Alias (User Manual Name) for PSI5_RDM3_9_H.
* To use register names with standard convension, please use PSI5_RDM3_9_H.
*/
#define	PSI5_RDMH39	(PSI5_RDM3_9_H)

/** \\brief  948, Receive Data Memory Low */
#define PSI5_RDM3_9_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005948u)

/** Alias (User Manual Name) for PSI5_RDM3_9_L.
* To use register names with standard convension, please use PSI5_RDM3_9_L.
*/
#define	PSI5_RDML39	(PSI5_RDM3_9_L)

/** \\brief  A04, Receive Data Memory High */
#define PSI5_RDM4_0_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A04u)

