HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** Alias (User Manual Name) for PSI5_RDM4_0_H.
* To use register names with standard convension, please use PSI5_RDM4_0_H.
*/
#define	PSI5_RDMH40	(PSI5_RDM4_0_H)

/** \\brief  A00, Receive Data Memory Low */
#define PSI5_RDM4_0_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A00u)

/** Alias (User Manual Name) for PSI5_RDM4_0_L.
* To use register names with standard convension, please use PSI5_RDM4_0_L.
*/
#define	PSI5_RDML40	(PSI5_RDM4_0_L)

/** \\brief  A54, Receive Data Memory High */
#define PSI5_RDM4_10_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A54u)

/** Alias (User Manual Name) for PSI5_RDM4_10_H.
* To use register names with standard convension, please use PSI5_RDM4_10_H.
*/
#define	PSI5_RDMH410	(PSI5_RDM4_10_H)

/** \\brief  A50, Receive Data Memory Low */
#define PSI5_RDM4_10_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A50u)

/** Alias (User Manual Name) for PSI5_RDM4_10_L.
* To use register names with standard convension, please use PSI5_RDM4_10_L.
*/
#define	PSI5_RDML410	(PSI5_RDM4_10_L)

/** \\brief  A5C, Receive Data Memory High */
#define PSI5_RDM4_11_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A5Cu)

/** Alias (User Manual Name) for PSI5_RDM4_11_H.
* To use register names with standard convension, please use PSI5_RDM4_11_H.
*/
#define	PSI5_RDMH411	(PSI5_RDM4_11_H)

/** \\brief  A58, Receive Data Memory Low */
#define PSI5_RDM4_11_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A58u)

/** Alias (User Manual Name) for PSI5_RDM4_11_L.
* To use register names with standard convension, please use PSI5_RDM4_11_L.
*/
#define	PSI5_RDML411	(PSI5_RDM4_11_L)

/** \\brief  A64, Receive Data Memory High */
#define PSI5_RDM4_12_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A64u)

/** Alias (User Manual Name) for PSI5_RDM4_12_H.
* To use register names with standard convension, please use PSI5_RDM4_12_H.
*/
#define	PSI5_RDMH412	(PSI5_RDM4_12_H)

/** \\brief  A60, Receive Data Memory Low */
#define PSI5_RDM4_12_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A60u)

/** Alias (User Manual Name) for PSI5_RDM4_12_L.
* To use register names with standard convension, please use PSI5_RDM4_12_L.
*/
#define	PSI5_RDML412	(PSI5_RDM4_12_L)

/** \\brief  A6C, Receive Data Memory High */
#define PSI5_RDM4_13_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A6Cu)

/** Alias (User Manual Name) for PSI5_RDM4_13_H.
* To use register names with standard convension, please use PSI5_RDM4_13_H.
*/
#define	PSI5_RDMH413	(PSI5_RDM4_13_H)

/** \\brief  A68, Receive Data Memory Low */
#define PSI5_RDM4_13_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A68u)

/** Alias (User Manual Name) for PSI5_RDM4_13_L.
* To use register names with standard convension, please use PSI5_RDM4_13_L.
*/
#define	PSI5_RDML413	(PSI5_RDM4_13_L)

/** \\brief  A74, Receive Data Memory High */
#define PSI5_RDM4_14_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A74u)

/** Alias (User Manual Name) for PSI5_RDM4_14_H.
* To use register names with standard convension, please use PSI5_RDM4_14_H.
*/
#define	PSI5_RDMH414	(PSI5_RDM4_14_H)

/** \\brief  A70, Receive Data Memory Low */
#define PSI5_RDM4_14_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A70u)

/** Alias (User Manual Name) for PSI5_RDM4_14_L.
* To use register names with standard convension, please use PSI5_RDM4_14_L.
*/
#define	PSI5_RDML414	(PSI5_RDM4_14_L)

/** \\brief  A7C, Receive Data Memory High */
#define PSI5_RDM4_15_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A7Cu)

/** Alias (User Manual Name) for PSI5_RDM4_15_H.
* To use register names with standard convension, please use PSI5_RDM4_15_H.
*/
#define	PSI5_RDMH415	(PSI5_RDM4_15_H)

/** \\brief  A78, Receive Data Memory Low */
#define PSI5_RDM4_15_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A78u)

/** Alias (User Manual Name) for PSI5_RDM4_15_L.
* To use register names with standard convension, please use PSI5_RDM4_15_L.
*/
#define	PSI5_RDML415	(PSI5_RDM4_15_L)

/** \\brief  A84, Receive Data Memory High */
#define PSI5_RDM4_16_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A84u)

/** Alias (User Manual Name) for PSI5_RDM4_16_H.
* To use register names with standard convension, please use PSI5_RDM4_16_H.
*/
#define	PSI5_RDMH416	(PSI5_RDM4_16_H)

/** \\brief  A80, Receive Data Memory Low */
#define PSI5_RDM4_16_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A80u)

/** Alias (User Manual Name) for PSI5_RDM4_16_L.
* To use register names with standard convension, please use PSI5_RDM4_16_L.
*/
#define	PSI5_RDML416	(PSI5_RDM4_16_L)

/** \\brief  A8C, Receive Data Memory High */
#define PSI5_RDM4_17_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A8Cu)

/** Alias (User Manual Name) for PSI5_RDM4_17_H.
* To use register names with standard convension, please use PSI5_RDM4_17_H.
*/
#define	PSI5_RDMH417	(PSI5_RDM4_17_H)

/** \\brief  A88, Receive Data Memory Low */
#define PSI5_RDM4_17_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A88u)

/** Alias (User Manual Name) for PSI5_RDM4_17_L.
* To use register names with standard convension, please use PSI5_RDM4_17_L.
*/
#define	PSI5_RDML417	(PSI5_RDM4_17_L)

/** \\brief  A94, Receive Data Memory High */
#define PSI5_RDM4_18_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A94u)

/** Alias (User Manual Name) for PSI5_RDM4_18_H.
* To use register names with standard convension, please use PSI5_RDM4_18_H.
*/
#define	PSI5_RDMH418	(PSI5_RDM4_18_H)

/** \\brief  A90, Receive Data Memory Low */
#define PSI5_RDM4_18_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A90u)

/** Alias (User Manual Name) for PSI5_RDM4_18_L.
* To use register names with standard convension, please use PSI5_RDM4_18_L.
*/
#define	PSI5_RDML418	(PSI5_RDM4_18_L)

/** \\brief  A9C, Receive Data Memory High */
#define PSI5_RDM4_19_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A9Cu)

/** Alias (User Manual Name) for PSI5_RDM4_19_H.
* To use register names with standard convension, please use PSI5_RDM4_19_H.
*/
#define	PSI5_RDMH419	(PSI5_RDM4_19_H)

/** \\brief  A98, Receive Data Memory Low */
#define PSI5_RDM4_19_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A98u)

/** Alias (User Manual Name) for PSI5_RDM4_19_L.
* To use register names with standard convension, please use PSI5_RDM4_19_L.
*/
#define	PSI5_RDML419	(PSI5_RDM4_19_L)

/** \\brief  A0C, Receive Data Memory High */
#define PSI5_RDM4_1_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A0Cu)

/** Alias (User Manual Name) for PSI5_RDM4_1_H.
* To use register names with standard convension, please use PSI5_RDM4_1_H.
*/
#define	PSI5_RDMH41	(PSI5_RDM4_1_H)

/** \\brief  A08, Receive Data Memory Low */
#define PSI5_RDM4_1_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A08u)

/** Alias (User Manual Name) for PSI5_RDM4_1_L.
* To use register names with standard convension, please use PSI5_RDM4_1_L.
*/
#define	PSI5_RDML41	(PSI5_RDM4_1_L)

