HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  AA4, Receive Data Memory High */
#define PSI5_RDM4_20_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AA4u)

/** Alias (User Manual Name) for PSI5_RDM4_20_H.
* To use register names with standard convension, please use PSI5_RDM4_20_H.
*/
#define	PSI5_RDMH420	(PSI5_RDM4_20_H)

/** \\brief  AA0, Receive Data Memory Low */
#define PSI5_RDM4_20_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AA0u)

/** Alias (User Manual Name) for PSI5_RDM4_20_L.
* To use register names with standard convension, please use PSI5_RDM4_20_L.
*/
#define	PSI5_RDML420	(PSI5_RDM4_20_L)

/** \\brief  AAC, Receive Data Memory High */
#define PSI5_RDM4_21_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AACu)

/** Alias (User Manual Name) for PSI5_RDM4_21_H.
* To use register names with standard convension, please use PSI5_RDM4_21_H.
*/
#define	PSI5_RDMH421	(PSI5_RDM4_21_H)

/** \\brief  AA8, Receive Data Memory Low */
#define PSI5_RDM4_21_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AA8u)

/** Alias (User Manual Name) for PSI5_RDM4_21_L.
* To use register names with standard convension, please use PSI5_RDM4_21_L.
*/
#define	PSI5_RDML421	(PSI5_RDM4_21_L)

/** \\brief  AB4, Receive Data Memory High */
#define PSI5_RDM4_22_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AB4u)

/** Alias (User Manual Name) for PSI5_RDM4_22_H.
* To use register names with standard convension, please use PSI5_RDM4_22_H.
*/
#define	PSI5_RDMH422	(PSI5_RDM4_22_H)

/** \\brief  AB0, Receive Data Memory Low */
#define PSI5_RDM4_22_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AB0u)

/** Alias (User Manual Name) for PSI5_RDM4_22_L.
* To use register names with standard convension, please use PSI5_RDM4_22_L.
*/
#define	PSI5_RDML422	(PSI5_RDM4_22_L)

/** \\brief  ABC, Receive Data Memory High */
#define PSI5_RDM4_23_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005ABCu)

/** Alias (User Manual Name) for PSI5_RDM4_23_H.
* To use register names with standard convension, please use PSI5_RDM4_23_H.
*/
#define	PSI5_RDMH423	(PSI5_RDM4_23_H)

/** \\brief  AB8, Receive Data Memory Low */
#define PSI5_RDM4_23_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AB8u)

/** Alias (User Manual Name) for PSI5_RDM4_23_L.
* To use register names with standard convension, please use PSI5_RDM4_23_L.
*/
#define	PSI5_RDML423	(PSI5_RDM4_23_L)

/** \\brief  AC4, Receive Data Memory High */
#define PSI5_RDM4_24_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AC4u)

/** Alias (User Manual Name) for PSI5_RDM4_24_H.
* To use register names with standard convension, please use PSI5_RDM4_24_H.
*/
#define	PSI5_RDMH424	(PSI5_RDM4_24_H)

/** \\brief  AC0, Receive Data Memory Low */
#define PSI5_RDM4_24_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AC0u)

/** Alias (User Manual Name) for PSI5_RDM4_24_L.
* To use register names with standard convension, please use PSI5_RDM4_24_L.
*/
#define	PSI5_RDML424	(PSI5_RDM4_24_L)

/** \\brief  ACC, Receive Data Memory High */
#define PSI5_RDM4_25_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005ACCu)

/** Alias (User Manual Name) for PSI5_RDM4_25_H.
* To use register names with standard convension, please use PSI5_RDM4_25_H.
*/
#define	PSI5_RDMH425	(PSI5_RDM4_25_H)

/** \\brief  AC8, Receive Data Memory Low */
#define PSI5_RDM4_25_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AC8u)

/** Alias (User Manual Name) for PSI5_RDM4_25_L.
* To use register names with standard convension, please use PSI5_RDM4_25_L.
*/
#define	PSI5_RDML425	(PSI5_RDM4_25_L)

/** \\brief  AD4, Receive Data Memory High */
#define PSI5_RDM4_26_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AD4u)

/** Alias (User Manual Name) for PSI5_RDM4_26_H.
* To use register names with standard convension, please use PSI5_RDM4_26_H.
*/
#define	PSI5_RDMH426	(PSI5_RDM4_26_H)

/** \\brief  AD0, Receive Data Memory Low */
#define PSI5_RDM4_26_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AD0u)

/** Alias (User Manual Name) for PSI5_RDM4_26_L.
* To use register names with standard convension, please use PSI5_RDM4_26_L.
*/
#define	PSI5_RDML426	(PSI5_RDM4_26_L)

/** \\brief  ADC, Receive Data Memory High */
#define PSI5_RDM4_27_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005ADCu)

/** Alias (User Manual Name) for PSI5_RDM4_27_H.
* To use register names with standard convension, please use PSI5_RDM4_27_H.
*/
#define	PSI5_RDMH427	(PSI5_RDM4_27_H)

/** \\brief  AD8, Receive Data Memory Low */
#define PSI5_RDM4_27_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AD8u)

/** Alias (User Manual Name) for PSI5_RDM4_27_L.
* To use register names with standard convension, please use PSI5_RDM4_27_L.
*/
#define	PSI5_RDML427	(PSI5_RDM4_27_L)

/** \\brief  AE4, Receive Data Memory High */
#define PSI5_RDM4_28_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AE4u)

/** Alias (User Manual Name) for PSI5_RDM4_28_H.
* To use register names with standard convension, please use PSI5_RDM4_28_H.
*/
#define	PSI5_RDMH428	(PSI5_RDM4_28_H)

/** \\brief  AE0, Receive Data Memory Low */
#define PSI5_RDM4_28_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AE0u)

/** Alias (User Manual Name) for PSI5_RDM4_28_L.
* To use register names with standard convension, please use PSI5_RDM4_28_L.
*/
#define	PSI5_RDML428	(PSI5_RDM4_28_L)

/** \\brief  AEC, Receive Data Memory High */
#define PSI5_RDM4_29_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AECu)

/** Alias (User Manual Name) for PSI5_RDM4_29_H.
* To use register names with standard convension, please use PSI5_RDM4_29_H.
*/
#define	PSI5_RDMH429	(PSI5_RDM4_29_H)

/** \\brief  AE8, Receive Data Memory Low */
#define PSI5_RDM4_29_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AE8u)

/** Alias (User Manual Name) for PSI5_RDM4_29_L.
* To use register names with standard convension, please use PSI5_RDM4_29_L.
*/
#define	PSI5_RDML429	(PSI5_RDM4_29_L)

/** \\brief  A14, Receive Data Memory High */
#define PSI5_RDM4_2_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A14u)

/** Alias (User Manual Name) for PSI5_RDM4_2_H.
* To use register names with standard convension, please use PSI5_RDM4_2_H.
*/
#define	PSI5_RDMH42	(PSI5_RDM4_2_H)

