HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  A10, Receive Data Memory Low */
#define PSI5_RDM4_2_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A10u)

/** Alias (User Manual Name) for PSI5_RDM4_2_L.
* To use register names with standard convension, please use PSI5_RDM4_2_L.
*/
#define	PSI5_RDML42	(PSI5_RDM4_2_L)

/** \\brief  AF4, Receive Data Memory High */
#define PSI5_RDM4_30_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AF4u)

/** Alias (User Manual Name) for PSI5_RDM4_30_H.
* To use register names with standard convension, please use PSI5_RDM4_30_H.
*/
#define	PSI5_RDMH430	(PSI5_RDM4_30_H)

/** \\brief  AF0, Receive Data Memory Low */
#define PSI5_RDM4_30_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AF0u)

/** Alias (User Manual Name) for PSI5_RDM4_30_L.
* To use register names with standard convension, please use PSI5_RDM4_30_L.
*/
#define	PSI5_RDML430	(PSI5_RDM4_30_L)

/** \\brief  AFC, Receive Data Memory High */
#define PSI5_RDM4_31_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AFCu)

/** Alias (User Manual Name) for PSI5_RDM4_31_H.
* To use register names with standard convension, please use PSI5_RDM4_31_H.
*/
#define	PSI5_RDMH431	(PSI5_RDM4_31_H)

/** \\brief  AF8, Receive Data Memory Low */
#define PSI5_RDM4_31_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AF8u)

/** Alias (User Manual Name) for PSI5_RDM4_31_L.
* To use register names with standard convension, please use PSI5_RDM4_31_L.
*/
#define	PSI5_RDML431	(PSI5_RDM4_31_L)

/** \\brief  A1C, Receive Data Memory High */
#define PSI5_RDM4_3_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A1Cu)

/** Alias (User Manual Name) for PSI5_RDM4_3_H.
* To use register names with standard convension, please use PSI5_RDM4_3_H.
*/
#define	PSI5_RDMH43	(PSI5_RDM4_3_H)

/** \\brief  A18, Receive Data Memory Low */
#define PSI5_RDM4_3_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A18u)

/** Alias (User Manual Name) for PSI5_RDM4_3_L.
* To use register names with standard convension, please use PSI5_RDM4_3_L.
*/
#define	PSI5_RDML43	(PSI5_RDM4_3_L)

/** \\brief  A24, Receive Data Memory High */
#define PSI5_RDM4_4_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A24u)

/** Alias (User Manual Name) for PSI5_RDM4_4_H.
* To use register names with standard convension, please use PSI5_RDM4_4_H.
*/
#define	PSI5_RDMH44	(PSI5_RDM4_4_H)

/** \\brief  A20, Receive Data Memory Low */
#define PSI5_RDM4_4_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A20u)

/** Alias (User Manual Name) for PSI5_RDM4_4_L.
* To use register names with standard convension, please use PSI5_RDM4_4_L.
*/
#define	PSI5_RDML44	(PSI5_RDM4_4_L)

/** \\brief  A2C, Receive Data Memory High */
#define PSI5_RDM4_5_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A2Cu)

/** Alias (User Manual Name) for PSI5_RDM4_5_H.
* To use register names with standard convension, please use PSI5_RDM4_5_H.
*/
#define	PSI5_RDMH45	(PSI5_RDM4_5_H)

/** \\brief  A28, Receive Data Memory Low */
#define PSI5_RDM4_5_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A28u)

/** Alias (User Manual Name) for PSI5_RDM4_5_L.
* To use register names with standard convension, please use PSI5_RDM4_5_L.
*/
#define	PSI5_RDML45	(PSI5_RDM4_5_L)

/** \\brief  A34, Receive Data Memory High */
#define PSI5_RDM4_6_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A34u)

/** Alias (User Manual Name) for PSI5_RDM4_6_H.
* To use register names with standard convension, please use PSI5_RDM4_6_H.
*/
#define	PSI5_RDMH46	(PSI5_RDM4_6_H)

/** \\brief  A30, Receive Data Memory Low */
#define PSI5_RDM4_6_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A30u)

/** Alias (User Manual Name) for PSI5_RDM4_6_L.
* To use register names with standard convension, please use PSI5_RDM4_6_L.
*/
#define	PSI5_RDML46	(PSI5_RDM4_6_L)

/** \\brief  A3C, Receive Data Memory High */
#define PSI5_RDM4_7_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A3Cu)

/** Alias (User Manual Name) for PSI5_RDM4_7_H.
* To use register names with standard convension, please use PSI5_RDM4_7_H.
*/
#define	PSI5_RDMH47	(PSI5_RDM4_7_H)

/** \\brief  A38, Receive Data Memory Low */
#define PSI5_RDM4_7_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A38u)

/** Alias (User Manual Name) for PSI5_RDM4_7_L.
* To use register names with standard convension, please use PSI5_RDM4_7_L.
*/
#define	PSI5_RDML47	(PSI5_RDM4_7_L)

/** \\brief  A44, Receive Data Memory High */
#define PSI5_RDM4_8_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A44u)

/** Alias (User Manual Name) for PSI5_RDM4_8_H.
* To use register names with standard convension, please use PSI5_RDM4_8_H.
*/
#define	PSI5_RDMH48	(PSI5_RDM4_8_H)

/** \\brief  A40, Receive Data Memory Low */
#define PSI5_RDM4_8_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A40u)

/** Alias (User Manual Name) for PSI5_RDM4_8_L.
* To use register names with standard convension, please use PSI5_RDM4_8_L.
*/
#define	PSI5_RDML48	(PSI5_RDM4_8_L)

/** \\brief  A4C, Receive Data Memory High */
#define PSI5_RDM4_9_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A4Cu)

/** Alias (User Manual Name) for PSI5_RDM4_9_H.
* To use register names with standard convension, please use PSI5_RDM4_9_H.
*/
#define	PSI5_RDMH49	(PSI5_RDM4_9_H)

/** \\brief  A48, Receive Data Memory Low */
#define PSI5_RDM4_9_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A48u)

/** Alias (User Manual Name) for PSI5_RDM4_9_L.
* To use register names with standard convension, please use PSI5_RDM4_9_L.
*/
#define	PSI5_RDML49	(PSI5_RDM4_9_L)

/** \\brief  3E4, Receive FIFO Control Register */
#define PSI5_RFC0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E4u)

/** \\brief  3E8, Receive FIFO Control Register */
#define PSI5_RFC1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E8u)

/** \\brief  3EC, Receive FIFO Control Register */
#define PSI5_RFC2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053ECu)

/** \\brief  3F0, Receive FIFO Control Register */
#define PSI5_RFC3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053F0u)

/** \\brief  3F4, Receive FIFO Control Register */
#define PSI5_RFC4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053F4u)

/** \\brief  560, RMIOV Clear Register */
#define PSI5_RMICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005560u)

/** \\brief  564, RMIOV Clear Register */
#define PSI5_RMICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005564u)

/** \\brief  568, RMIOV Clear Register */
#define PSI5_RMICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005568u)

/** \\brief  56C, RMIOV Clear Register */
#define PSI5_RMICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF000556Cu)

/** \\brief  570, RMIOV Clear Register */
#define PSI5_RMICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005570u)

/** \\brief  420, RMI Overview Register */
#define PSI5_RMIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005420u)

/** \\brief  424, RMI Overview Register */
#define PSI5_RMIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005424u)

