HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxPsi5_reg.h
/** \\brief  428, RMI Overview Register */
#define PSI5_RMIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005428u)

/** \\brief  42C, RMI Overview Register */
#define PSI5_RMIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF000542Cu)

/** \\brief  430, RMI Overview Register */
#define PSI5_RMIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005430u)

/** \\brief  4C0, RMIOV Set Register */
#define PSI5_RMISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C0u)

/** \\brief  4C4, RMIOV Set Register */
#define PSI5_RMISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C4u)

/** \\brief  4C8, RMIOV Set Register */
#define PSI5_RMISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C8u)

/** \\brief  4CC, RMIOV Set Register */
#define PSI5_RMISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054CCu)

/** \\brief  4D0, RMIOV Set Register */
#define PSI5_RMISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054D0u)

/** \\brief  54C, RSIOV Clear Register */
#define PSI5_RSICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000554Cu)

/** \\brief  550, RSIOV Clear Register */
#define PSI5_RSICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005550u)

/** \\brief  554, RSIOV Clear Register */
#define PSI5_RSICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005554u)

/** \\brief  558, RSIOV Clear Register */
#define PSI5_RSICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005558u)

/** \\brief  55C, RSIOV Clear Register */
#define PSI5_RSICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000555Cu)

/** \\brief  40C, RSI Overview Register */
#define PSI5_RSIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000540Cu)

/** \\brief  410, RSI Overview Register */
#define PSI5_RSIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005410u)

/** \\brief  414, RSI Overview Register */
#define PSI5_RSIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005414u)

/** \\brief  418, RSI Overview Register */
#define PSI5_RSIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005418u)

/** \\brief  41C, RSI Overview Register */
#define PSI5_RSIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000541Cu)

/** \\brief  4AC, RSIOV Set Register */
#define PSI5_RSISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054ACu)

/** \\brief  4B0, RSIOV Set Register */
#define PSI5_RSISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B0u)

/** \\brief  4B4, RSIOV Set Register */
#define PSI5_RSISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B4u)

/** \\brief  4B8, RSIOV Set Register */
#define PSI5_RSISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B8u)

/** \\brief  4BC, RSIOV Set Register */
#define PSI5_RSISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054BCu)

/** \\brief  588, TEIOV Clear Register */
#define PSI5_TEICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005588u)

/** \\brief  58C, TEIOV Clear Register */
#define PSI5_TEICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF000558Cu)

/** \\brief  590, TEIOV Clear Register */
#define PSI5_TEICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005590u)

/** \\brief  594, TEIOV Clear Register */
#define PSI5_TEICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005594u)

/** \\brief  598, TEIOV Clear Register */
#define PSI5_TEICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005598u)

/** \\brief  448, TEI Overview Register */
#define PSI5_TEIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005448u)

/** \\brief  44C, TEI Overview Register */
#define PSI5_TEIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF000544Cu)

/** \\brief  450, TEI Overview Register */
#define PSI5_TEIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005450u)

/** \\brief  454, TEI Overview Register */
#define PSI5_TEIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005454u)

/** \\brief  458, TEI Overview Register */
#define PSI5_TEIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005458u)

/** \\brief  4E8, TEIOV Set Register */
#define PSI5_TEISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054E8u)

/** \\brief  4EC, TEIOV Set Register */
#define PSI5_TEISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054ECu)

/** \\brief  4F0, TEIOV Set Register */
#define PSI5_TEISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F0u)

/** \\brief  4F4, TEIOV Set Register */
#define PSI5_TEISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F4u)

/** \\brief  4F8, TEIOV Set Register */
#define PSI5_TEISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F8u)

/** \\brief  1C, Time Stamp Register A */
#define PSI5_TSRA /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF000501Cu)

/** \\brief  20, Time Stamp Register B */
#define PSI5_TSRB /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF0005020u)

/** \\brief  24, Time Stamp Register C */
#define PSI5_TSRC /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF0005024u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_REG_H */
